const motels = [
  {
    storeName: "강남 더 뮤즈",
    rentableRooms: 23000,
    accommodations: 60000,
    opt1: ["트윈베드", "파티룸", "거울룸", "복층룸", "야외테라스"],
    opt2: ["사우나/찜질방", "욕실 TV", "노천탕", "히노끼탕"],
    opt3: ["미니 Bar", "3D TV", "수영장", "게임기"],
    image: "../images/f548520417580511897f4c4daeec7cc8.jpg",
  },
  {
    storeName: "강남 카파쓰",
    rentableRooms: 34000,
    accommodations: 60000,
    opt1: ["무인텔", "하늘뷰", "야외테라스"],
    opt2: ["욕실 TV", "반신욕", "노천탕"],
    opt3: ["미니 Bar", "노래방"],
    image: "../images/27979e4e4f66f72ca7a9fc405fd990a9.jpg",
  },
  {
    storeName: "신사 짝",
    rentableRooms: 30000,
    accommodations: 47000,
    opt1: ["트윈베드"],
    opt2: ["스파/월풀"],
    opt3: ["3D TV", "미니 Bar", "게임기", "노래방", "수영장"],
    image: "../images/159adf87e9c3bfd57b19fbaf39a28b9c.jpg",
  },
  {
    storeName: "역삼 트리아",
    rentableRooms: 35000,
    accommodations: 45000,
    opt1: [
      "트윈베드",
      "무인텔",
      "호수뷰",
      "야외테라스",
      "거울룸",
      "파티룸",
      "복층룸",
    ],
    opt2: ["사우나/찜질방", "반신욕", "맛사지 베드", "스파/월풀", "노천탕"],
    opt3: ["당구대", "노래방", "안마의자", "수영장", "게임기", "3D TV"],
    image: "../images/31e35e28aac77ee4a59063df926dbdf5",
  },
  {
    storeName: "역삼 호텔 오늘",
    rentableRooms: 31000,
    accommodations: 68000,
    opt1: ["하늘뷰", "야외테라스"],
    opt2: ["사우나/찜질방", "반신욕", "노천탕", "맛사지 베드", "욕실 TV"],
    opt3: [
      "수영장",
      "노래방",
      "당구대",
      "3D TV",
      "미니 Bar",
      "빔프로젝터",
      "게임기",
    ],
    image: "../images/7fbdb68cdc1d7c629328ebced99a461a",
  },
  {
    storeName: "강남 렉시",
    rentableRooms: 32000,
    accommodations: 60000,
    opt1: ["트윈베드", "파티룸", "거울룸", "복층룸", "야외테라스"],
    opt2: ["사우나/찜질방", "욕실 TV", "노천탕", "히노끼탕"],
    opt3: ["미니 Bar", "3D TV", "수영장", "게임기"],
    image: "",
  },
  {
    storeName: "강남 멜리샤호텔",
    rentableRooms: 35000,
    accommodations: 54000,
    opt1: [],
    opt2: ["히노끼탕", "노천탕"],
    opt3: ["3D TV", "게임기", "미니 Bar", "수영장"],
    image: "",
  },
  {
    storeName: "역삼 디노",
    rentableRooms: 32000,
    accommodations: 70000,
    opt1: [
      "거울룸",
      "파티룸",
      "복층룸",
      "하늘뷰",
      "트윈베드",
      "호수뷰",
      "무인텔",
      "야외테라스",
      "바다뷰",
    ],
    opt2: [],
    opt3: [],
    image: "",
  },
  {
    storeName: "신사 하이랜드",
    rentableRooms: 0,
    accommodations: 58000,
    opt1: [],
    opt2: ["노천탕", "맛사지 베드", "히노끼탕", "욕실 TV", "사우나/찜질방"],
    opt3: ["게임기", "수영장", "커플 PC", "미니 Bar", "노래방", "3D TV"],
    image: "../images/19669a49cb68e7a6f346150978d7f851.jpg",
  },
  {
    storeName: "강남 제리스플래닛",
    rentableRooms: 35000,
    accommodations: 0,
    opt1: [],
    opt2: ["욕실 TV", "스파/월풀"],
    opt3: ["수영장", "노래방"],
    image: "../images/37a36175d5bb220a8abb064f7849b7d8.jpg",
  },
  {
    storeName: "강남 녹스 호텔",
    rentableRooms: 33000,
    accommodations: 60000,
    opt1: ["무인텔", "하늘뷰", "야외테라스"],
    opt2: ["욕실 TV", "반신욕", "노천탕"],
    opt3: ["미니 Bar", "노래방"],
    image: "",
  },
  {
    storeName: "강남 더 디자이너스",
    rentableRooms: 31000,
    accommodations: 43000,
    opt1: [],
    opt2: ["반신욕", "맛사지 베드", "스파/월풀", "노천탕", "욕실 TV"],
    opt3: [
      "노래방",
      "당구대",
      "수영장",
      "게임기",
      "안마의자",
      "커플 PC",
      "빔프로젝터",
    ],
    image: "../images/06.jpg",
  },
  {
    storeName: "강남 캠퍼스",
    rentableRooms: 31000,
    accommodations: 60000,
    opt1: ["트윈베드"],
    opt2: ["스파/월풀"],
    opt3: ["3D TV", "미니 Bar", "게임기", "노래방", "수영장"],
    image: "",
  },
];

const secondCategory = [
  {
    li: ["무인텔", "거울룸", "공주룸", "야외테라스", "호수뷰"],
    id: ["tmino_1", "tmino_3", "tmino_5", "tmino_7", "tmino_9"],
  },
  {
    li: ["파티룸", "복층룸", "트윈베드", "바다뷰", "하늘뷰"],
    id: ["tmino_2", "tmino_4", "tmino_6", "tmino_8", "tmino_10"],
  },
];

const thirdCategory = [
  {
    li: ["스파/월풀", "맛사지 베드", "노천탕", "욕실 TV"],
    id: ["tmino_11", "tmino_13", "tmino_15", "tmino_17"],
  },
  {
    li: ["사우나/찜질방", "히노끼탕", "반신욕"],
    id: ["tmino_12", "tmino_14", "tmino_16"],
  },
];

const fourthCategory = [
  {
    li: ["수영장", "당구대", "안마의자", "미니Bar", "빔프로젝터"],
    id: ["tmino_18", "tmino_20", "tmino_22", "tmino_24", "tmino_26"],
  },
  {
    li: ["노래방", "게임기", "커플 PC", "3D TV"],
    id: ["tmino_19", "tmino_21", "tmino_23", "tmino_25"],
  },
];

const calendar = [
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    [1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]
]
//
// const checked = [
//     "무인텔",
//     "파티룸",
//     "거울룸",
//     "복층룸",
//     "공주룸"
// ]

// const a = motels.filter((x) => x.opt1.filter((y) => {
//     return checked.includes(y).length > 0}));